<div id="mainbar-full">
	<div class="subheader">
        <h1 id="h-all-questions">FAQ</h1>
    </div>
	<div class="content-page">
		<h3>在本站点我能问什么问题？</h3>
		<p>本站点为那些钟爱编程的人们而建，你可以在这里提任何在编程中遇到的问题，比如说...</p>
		<ul>
			<li>语法问题</li>
			<li>算法问题</li>
			<li>甚至是编译工具的问题</li>
		</ul>
		<p>需要注意的是，请在提问之前看看是否已经有人已经提过同样的问题。</p>
		<p>你也可以去回答你自己提出的问题。</p>

		<h3>在本站点什么问题我不应该问？</h3>
		<P>本站点不允许提那些过于开放的问题、没有实际意义的问题甚至说是聊天性质的问题。如果你不想你的问题被举报，尽量避免你的问题属于上述情形之列。</P>
		<p>举个例子，如果你想提一个“我想讨论下……”之类的问题，那你不应该在这里提，因为这样的问题过于开放。但是如果你想提一个“我想请教一下……为什么是这样？”之类的问题，那么你可以在这里提，因为你可以得到一个明确的答案。</p>
		<p>如果你的问题是关于本站点本身的，现在你可以在这里提，但是将来我们会做一个专门的站点，让你提出你在本站点所遇到的问题，甚至是bug。</p>

		<h3>我是不是一定需要一个帐号？</h3>
		<p>并不一定需要，你可以匿名浏览所有的问题和答案，并可以对特定的问题进行搜索。但是我们希望你注册一个帐号更方便你提出问题和回答解决别人提出的问题。而且注册后你可以通过提出问题和回答问题来获得威望，从而获得一些在本站点的特权。</p>

		<h3>我该如何提问？</h3>
		<P>使用简洁明确的标题。一个好的标题可以节省回答者的时间，不要用“帮帮忙”（更别说“救命啊！”这样让人反感的话）等对问题没有意义的词语。</P>
		<p>在你的提问内容里，需要提供精确有效的信息。这并不是要求你简单的把大量的出错代码或者数据完全转储摘录到你的提问问题中。如果你有庞大而复杂的测试条件，尽量把它剪裁得越小越好。　</p>
		<p>这样做的好处至少有三点。第一，表现出你为简化问题付出了努力，这可以使你得到回答的机会增加；第二，简化问题使你得到有用答案的机会增加；第三，在提炼 你的bug报告的过程中，也许你自己就能找出问题所在或作出更正。</p>
		<h3>提问后我该做什么?</h3>
		<p>当你在本站发了提问帖之后，在几分钟之内该贴可能就会被其他用户看到并给出一个好的答案，所以你应该经常回来看看你的问题是不是已经很好的得到回答。</p>
		<p>如果你的问题有些东西需要进一步说明，你可以在问题下方添加评论。如果其他用户在评论中希望得到更多的信息，你也可以对你的问题进行编辑。通过以上两种方式，你将可以获得最佳的答案。</p>
		<p>你可以对你觉得有用的答案通过点击答案左侧的向上箭头进行支持投票，支持票数最多的答案一般排在最前列。这样可以使得更多的人看到好的答案。别人也可以对你提出问题中的答案进行投票。</p>
		<p>当你找到你认为的最佳答案是，你可以将其选为“接受答案”，这样可以表明你已经得到了你提出问题的最佳答案，你从本站点获得有价值的信息。</p>

		<h3>什么是威望？</h3>
		<p>威望并不是必须的，即使没有威望你也可以提问题，回答问题。但是如果你想来帮助我们，你必须要有一定的威望。威望是本站点对你信任程度的一种衡量。威望不是本站点给予的，而是你通过你自己的努力赚得的。</p>
		<p>获得威望最主要的方法是发好的问题帖和答案贴。通过人们对你问题帖或答案贴的投票，你将获得（或者失去）威望，这也反映了其他用户对你的认可程度。		</p>
		<table>
			<tbody>
				<tr><td>答案获得支持投票 </td><td class="x">+10</td><td></td></tr>
				<tr><td>问题获得支持投票</td><td class="x">+5</td><td></td></tr>
				<tr><td>答案被接受</td><td class="x">+15</td><td>（提问人+2）</td></tr>
				<tr><td>问题获得反对投票</td><td class="x">-2</td><td></td></tr>
				<tr><td>答案获得反对投票</td><td class="x">-2</td><td>（投票人-1）</td></tr>
			</tbody>
		</table>
		<p>每个用户每天最多只能投40票，可以获得最多200威望（赏金以及答案被接受获得的威望不在此限制之内）。还有就是wiki贴不产生威望。</p>
<!--		<p>如果你是新用户，那么你还可以通过对帖子进行编辑获得威望。每次编辑一旦审核通过，你获得+2威望，你可以通过该方法获得最到1000威望。</p>-->
		<p>通过威望的积累，你会被授予额外的权限：</p>
		<table>
			<tbody>
				<tr><td class="x">15</td><td>投支持票</td></tr>
				<tr><td class="x">15</td><td>举报引起版主注意</td></tr>
				<tr><td class="x">50</td><td>评论任意贴</td></tr>
				<tr><td class="x">100</td><td>编辑wiki贴</td></tr>
				<tr><td class="x">125</td><td>投反对票</td></tr>
<!--				<tr><td class="x">200</td><td>减少广告</td></tr>-->
				<tr><td class="x">250</td><td>投票关闭、重开或是合并你的问题</td></tr>
				<tr><td class="x">500</td><td>对问题重新标签</td></tr>
<!--				<tr><td class="x">1000</td><td>显示所有的支持票和反对票数量</td></tr>-->
				<tr><td class="x">1500</td><td>创建新的标签</td></tr>
				<tr><td class="x">2000</td><td>编辑其他用户的帖子，投票支持或拒绝无权限用户的编辑</td></tr>
				<tr><td class="x">3000</td><td>投票关闭、重开或合并任意的问题</td></tr>
				<tr><td class="x">5000</td><td>投票支持或拒绝无权限用户标签wiki编辑</td></tr>
				<tr><td class="x">10000</td><td>投票删除被关闭的问题，访问版主工具</td></tr>
				<tr><td class="x">15000</td><td>使问题回答受限</td></tr>
				<tr><td class="x">20000</td><td>投票删除负投票答案</td></tr>
			</tbody>
		</table>
		<p>版主和高威望用户会有一些区别，但是我们希望所有获得权限的用户来一起推进站点的发展。</p>

		<h3><a name="bounty"></a>如果我没有得到好的答案该怎么办？</h3>
		<p>首先要确定你的问题是不是够好，要想得到最佳的答案，你必须使你的问题明确清晰。对你的问题进行说明改进，这样也会使得你的问题得到更多用户的兴趣。</p>
		<p>如果你认为你已经把你的问题陈述的足够清楚，但是依然没有得到最佳的答案，那么你可以对问题进行悬赏，赏金从<span class="bounty-award">+50</span>到<span class="bounty-award">+500</span>，被悬赏的问题会有专门的页面显示。</p>
		<p>下面是悬赏的一些规则：</p>
		<ol>
			<li>问题至少已经提出了2天	</li>
			<li>用户至少有75威望</li>
			<li>每个用户在同一时刻只能给一个问题提出悬赏</li>
			<li>发出悬赏之后，你必须等待一天才能对某个答案发出赏金</li>
			<li>如果7天之内你没有对任何一个答案发出赏金，那么一半的赏金会被自动授予给获得至少2票的答案</li>
			<li>悬赏一旦发出，赏金会立刻从你威望中扣除，而无论你最后是不是发出赏金，你的威望都不可能收回。</li>
<!--			<li>赏金不受威望帽限制</li>-->
		</ol>

		<h3>为什么关闭问题？</h3>
		<p>完全脱离主题的问题会被关闭。威望达到3000的用户可每天对问题发出最多50个关闭投票，一旦某个问题的关闭投票达到5票，问题被标记为关闭状态，并且不能接受新的答案。被关闭的问题可以通过重开投票重开。但是一个用户只能对某个问题关闭或重开进行一次投票。</p>

		<h3>为什么某些问题或答案被移除？</h3>
		<p>极度离题或是质量极差的问题会被移除，被关闭的问题如果表明完全无用也会被移除，还有那些很长时间没有答案的问题也可能会被移除。</p>
		<p>和问题完全无关的答案会被移除。例如在答案中问其它的问题，重复的答案或者是“谢谢”之类的答案。如果你想改进的你的答案避免被移除，你可以对你的答案进行编辑。</p>

		<h3>如果发现不好的内容我该怎么办？</h3>
		<p>首先你可以通过举报系统让我们来知道这件事。每个评论和帖子都可以举报，好好使用举报功能。我们尽力维护我们的社区，这也需要你的帮助。你也可以直接发邮件给我们，如果你认为事态极其严重。我们对此深表感谢！</p>

		<h3>其他人可以编辑我的帖子？</h3>
		<p>	是这样的，本站点的任何帖子任何用户都可以编辑，并且可以追溯所有的编辑版本。如果你对于你的问题或答案可以被别人编辑感到不舒服，那么本站点可能不适合你。</p>
		<p>我们希望所有的用户互相尊重、待人以诚。我们在这里相互学习，也要相互容忍。毕竟人各有所长、亦各有其短。永远不要去嘲笑那些你看来很简单的问题。</p>
		<p>我们也希望诚实待人，不要去提供一些误导信息，看到误导信息及时去纠正或是通知我们一起关闭删除。尽我们之所能提供最佳的答案，并对现有的问题和答案持续的编辑改进。</p>
		<p>这是我们共同拥有的社区，共同学习进步的平台，让我们去珍惜去努力以使得这个社区变得更好。</p>

	</div>
	<div class="cbt"></div>
</div>
<div id="sidebar">
</div>